resources/schemas/RPC/Schemas/wsdl/RepeatCallers.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="NHS111" targetNamespace="urn:nhs-itk:ns:201005" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="urn:nhs-itk:ns:201005" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:i0="urn:nhs-itk:services:201005" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:import namespace="urn:nhs-itk:services:201005" location="http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc?wsdl=wsdl0"/><wsdl:types><xsd:schema targetNamespace="urn:nhs-itk:ns:201005/Imports"><xsd:import schemaLocation="http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc?xsd=xsd0" namespace="urn:nhs-itk:ns:201005"/></xsd:schema></wsdl:types><wsdl:message name="SendNHS111Reportv20Request"><wsdl:part name="SendNHS111Report-v2-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="AcknowledgementResponse"><wsdl:part name="acknowledgementResponse" element="tns:SimpleMessageResponse"/></wsdl:message><wsdl:message name="SendNHS111Report-v2-0_ptt_SendNHS111Report-v2-0_ToolkitErrorInfo_FaultMessage"><wsdl:part name="detail" element="tns:ToolkitErrorInfo"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryRespv10Request"><wsdl:part name="NHS111RepeatCallerQuery-v1-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryRespv10Response"><wsdl:part name="NHS111RepeatCallerResponse-v1-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryResp-v1-0_ptt_NHS111RepeatCallerSyncQueryResp-v1-0_ToolkitErrorInfo_FaultMessage"><wsdl:part name="detail" element="tns:ToolkitErrorInfo"/></wsdl:message><wsdl:message name="RequestAmbulanceDispatchv20Request"><wsdl:part name="RequestAmbulanceDispatch-v2-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="RequestAmbulanceDispatch-v2-0_ptt_RequestAmbulanceDispatch-v2-0_ToolkitErrorInfo_FaultMessage"><wsdl:part name="detail" element="tns:ToolkitErrorInfo"/></wsdl:message><wsdl:portType name="SendNHS111Report-v2-0_ptt"><wsdl:operation name="SendNHS111Report-v2-0"><wsdl:input wsaw:Action="urn:nhs-itk:services:201005:SendNHS111Report-v2-0" name="SendNHS111Reportv20Request" message="tns:SendNHS111Reportv20Request"/><wsdl:output wsaw:Action="urn:nhs-itk:ns:201005/SendNHS111Report-v2-0_ptt/SendNHS111Report-v2-0Response" name="AcknowledgementResponse" message="tns:AcknowledgementResponse"/><wsdl:fault wsaw:Action="http://www.w3.org/2005/08/addressing/soap/fault" name="ToolkitErrorInfo" message="tns:SendNHS111Report-v2-0_ptt_SendNHS111Report-v2-0_ToolkitErrorInfo_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:portType name="NHS111RepeatCallerSyncQueryResp-v1-0_ptt"><wsdl:operation name="NHS111RepeatCallerSyncQueryResp-v1-0"><wsdl:input wsaw:Action="urn:nhs-itk:services:201005:NHS111RepeatCallerSyncQueryResp-v1-0" name="NHS111RepeatCallerSyncQueryRespv10Request" message="tns:NHS111RepeatCallerSyncQueryRespv10Request"/><wsdl:output wsaw:Action="urn:nhs-itk:ns:201005/NHS111RepeatCallerSyncQueryResp-v1-0_ptt/NHS111RepeatCallerSyncQueryResp-v1-0Response" name="NHS111RepeatCallerSyncQueryRespv10Response" message="tns:NHS111RepeatCallerSyncQueryRespv10Response"/><wsdl:fault wsaw:Action="http://www.w3.org/2005/08/addressing/soap/fault" name="ToolkitErrorInfo" message="tns:NHS111RepeatCallerSyncQueryResp-v1-0_ptt_NHS111RepeatCallerSyncQueryResp-v1-0_ToolkitErrorInfo_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:portType name="RequestAmbulanceDispatch-v2-0_ptt"><wsdl:operation name="RequestAmbulanceDispatch-v2-0"><wsdl:input wsaw:Action="urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0" name="RequestAmbulanceDispatchv20Request" message="tns:RequestAmbulanceDispatchv20Request"/><wsdl:output wsaw:Action="urn:nhs-itk:ns:201005/RequestAmbulanceDispatch-v2-0_ptt/RequestAmbulanceDispatch-v2-0Response" name="AcknowledgementResponse" message="tns:AcknowledgementResponse"/><wsdl:fault wsaw:Action="http://www.w3.org/2005/08/addressing/soap/fault" name="ToolkitErrorInfo" message="tns:RequestAmbulanceDispatch-v2-0_ptt_RequestAmbulanceDispatch-v2-0_ToolkitErrorInfo_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:service name="NHS111"><wsdl:port name="SendNHS111Report-v2-0_pttPort" binding="i0:SendNHS111Report-v2-0_pttBinding"><soap:address location="http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc"/><wsa10:EndpointReference><wsa10:Address>http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port><wsdl:port name="NHS111RepeatCallerSyncQueryResp_pttPort" binding="i0:NHS111RepeatCallerSyncQueryResp-v1-0_pttBinding"><soap:address location="http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc"/><wsa10:EndpointReference><wsa10:Address>http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port><wsdl:port name="RequestAmbulanceDispatch-v2-0_pttPort" binding="i0:RequestAmbulanceDispatch-v2-0_pttBinding"><soap:address location="http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc"/><wsa10:EndpointReference><wsa10:Address>http://services.nhsdirect.nhs.uk/REPEATCALLERV2UAT/RepeatCallers.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port></wsdl:service></wsdl:definitions>